app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def show
    @student = Student.find {|s| s.id == params[:id].to_i}